In [1]:
import numpy as np
import pandas as pd
df1 = pd.read_csv('BTC-USD_day_yfin.csv')

In [2]:
df1['Price'] = df1['Adj Close']
df2 = df1[['Date','Price']]
df2 = df2.iloc[::-1]

In [3]:
df2

            Date         Price
2190  2023-12-31  42265.187500
2189  2023-12-30  42156.902344
2188  2023-12-29  42099.402344
2187  2023-12-28  42627.855469
2186  2023-12-27  43442.855469
...          ...           ...
4     2018-01-05  17429.500000
3     2018-01-04  15599.200195
2     2018-01-03  15201.000000
1     2018-01-02  14982.099609
0     2018-01-01  13657.200195

[2191 rows x 2 columns]

In [4]:
df2['Price_lag1'] = df2['Price'].shift(-1)
df2

            Date         Price    Price_lag1
2190  2023-12-31  42265.187500  42156.902344
2189  2023-12-30  42156.902344  42099.402344
2188  2023-12-29  42099.402344  42627.855469
2187  2023-12-28  42627.855469  43442.855469
2186  2023-12-27  43442.855469  42520.402344
...          ...           ...           ...
4     2018-01-05  17429.500000  15599.200195
3     2018-01-04  15599.200195  15201.000000
2     2018-01-03  15201.000000  14982.099609
1     2018-01-02  14982.099609  13657.200195
0     2018-01-01  13657.200195           NaN

[2191 rows x 3 columns]

In [5]:
df3 = df2.head(365)

In [6]:
sum((df3['Price_lag1']-df3['Price'])**2)/365

430132.64581044327